imashio/STM32F303_MFM/Src/main.c
  ///// Timer /////
  // TIM1 - PWM for Fuel Pump Driver (Cycle 100kHz = 1MHz / 100count)
  /*
  if (HAL_TIM_Base_Start_IT(&htim1) != HAL_OK)
  {
    Error_Handler();
  }
  */
  // Start Timer1 / ch1
  if (HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }

  // TIM2 - display (Cycle 20ms = 1/100kHz x 2,000count)
  if (HAL_TIM_Base_Start_IT(&htim2) != HAL_OK)
  {
    Error_Handler();
  }

  // TIM3 - Pulse counter for Tacho (f 200kHz, count 65535)
  if (HAL_TIM_Base_Start_IT(&htim3) != HAL_OK)
  {
    Error_Handler();
  }

  // TIM6 - SW interrupt control (Cycle 100ms = 1/100kHz x 10,000count)
  if (HAL_TIM_Base_Start_IT(&htim6) != HAL_OK)
  {
    Error_Handler();
  }

  // UART1 interrupt setup for DEFI decoder
  HAL_UART_Receive_IT(&huart1, &UART1_Data, 1);
  // variables is defined in 'defi.h'


  // ADC (for PA0) buffer definition
  enum{ ADC_BUFFER_LENGTH = 1024 };
  uint16_t g_ADCBuffer[ADC_BUFFER_LENGTH];
  memset(g_ADCBuffer, 0, sizeof(g_ADCBuffer));
  HAL_ADC_Start_DMA(&hadc1, g_ADCBuffer, ADC_BUFFER_LENGTH);


  // OLED diaplay initialization
  u8g2_Setup_ssd1309_128x64_noname2_f(&u8g2, U8G2_R0, u8x8_byte_4wire_hw_spi, u8x8_gpio_and_delay_STM32F303);  // init u8g2 structure

  // OLED display Reset (must be more than 3us!!)
  HAL_GPIO_WritePin( GPIOB, GPIO_PIN_3, 0); // Set RES=L (OLED Reset)
  HAL_Delay(5);
  HAL_GPIO_WritePin( GPIOB, GPIO_PIN_3, 1); // Set RES=H (OLED activate)
  u8g2_InitDisplay(&u8g2); // send init sequence to the display, display is in sleep mode after this,
  u8g2_SetPowerSave(&u8g2, 0); // wake up display
  u8g2_SetContrast(&u8g2, 255); // set contrast
  u8g2_ClearDisplay(&u8g2);

  // draw opening
  u8g2_DrawXBMP(&u8g2, 40, 0, logo_width, logo_height, logo_bits );

  u8g2_SetFont(&u8g2, u8g2_font_5x7_tf);
  u8g2_DrawStr(&u8g2, 16, 63 - 8, "Multi Function Meter");
  u8g2_DrawStr(&u8g2, 40, 64, "Rev. 0.1a");
  u8g2_SendBuffer(&u8g2);

  HAL_Delay(500);
//  HAL_Delay(2000);

  u8g2_ClearBuffer(&u8g2);

  HAL_UART_Transmit_printf(&huart2, "Hello. This is MFM.\n");

  // Set PWM Duty for Timer1 / Output1 (Asymmetric PWM2)
  TIM1->CCR1 = (100 - FP_duty);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  draw_MeasLabels();
  draw_indicators();
  u8g2_SendBuffer(&u8g2);


  // I2C communication to ADXL345(3-axis G-sensor)
  a = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x00); // DEIVID
  ADXL345_RegWrite(ADXL0_ADDR, 0x2D, 0x08); // Enable 'Measure' at "POWER_CTL"
  a = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x2D); // Check "POWER_CTL"


  while(1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */

    ///// ADC ----------------------------------------------------------------
		// read O2 sensor ADC output
		O2_volt = (int16_t)(330 * (float)g_ADCBuffer[0]/255);

		// read Fuel Pump Voltage ADC output
		FP_volt = (int16_t)((165/33)*33*(float)g_ADCBuffer[0]/255);
    // Ressister attenation ratio '165/33'
    FP_duty = (int16_t)(FP_volt/(16.6)*10);

    //// Measure data  ----------------------------------------------------------------
    defi_decoder(UART1_RxData); // DEFI decoder

    if( flag_meas == 1 ){

      // I2C communication to ADXL345(3-axis G-sensor)
      Gsens_X1 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x33); // Check "DATAX1" (MSB side)
      Gsens_X0 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x32); // Check "DATAX0" (LSB side)
      Gsens_X = (Gsens_X1<<8) | Gsens_X0;
      Gsens_Y1 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x35); // Check "DATAY1" (MSB side)
      Gsens_Y0 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x34); // Check "DATAY0" (LSB side)
      Gsens_Y = (Gsens_Y1<<8) | Gsens_Y0;
      Gsens_Z1 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x37); // Check "DATAZ1" (MSB side)
      Gsens_Z0 = ADXL345_RegRead_1byte(ADXL0_ADDR, 0x36); // Check "DATAZ0" (LSB side)
      Gsens_Z = (Gsens_Z1<<8) | Gsens_Z0;
      HAL_UART_Transmit_printf(&huart2, "(%d,%d,%d)\n", Gsens_X, Gsens_Y, Gsens_Z); // debug

/*
  	  // start of create dummy data for debug
      if( rpm <= 8200 ){
          rpm = rpm + (int)(20*MT[gear]);
          //rpm=rpm+10;
      }else{
        if( gear < 4 ){
          gear++;
          rpm = (double)speed / (0.002*60.0) * (MT[gear]*4.1);
        }else{
          gear = 0;
          rpm = 1000;
        }
      }
      speed = (double)rpm*0.002*60.0/MT[gear]/4.1;

      if( a >= 150){
        a = 0;
      }else{
        a++;
      }
  	  // end of create dummy data for debug
*/
      meas_value[0] = DEFI_value[0];  // MAP
		  meas_value[1] = DEFI_value[2];  // OILP
			meas_value[2] = FP_volt;        // FuelPump Voltage
		  meas_value[3] = DEFI_value[6];  // ECT
			meas_value[4] = DEFI_value[5];  // OILT
		  meas_value[5] = O2_volt;        // O2


      flag_meas = 0; // enable again by TIM2 interrupt
    }

    ///// FP driver ----------------------------------------------------------------
    // Set PWM Duty for Timer1 / Output1 (Asymmetric PWM2)
    TIM1->CCR1 = (100 - FP_duty);

    ///// Switch ----------------------------------------------------------------
    if( flag_sw != 0 ){
      switch( flag_sw ){
        case 1:
          HAL_UART_Transmit_printf(&huart2, "UP ");
          HAL_NVIC_DisableIRQ(EXTI9_5_IRQn);
          // SW "UP"
          if( setting == 0 ){
            if( mode == N_mode-1 ){
              mode = 0;
            }else{
              mode++;
            }
          }
          break;
        case 2:
          HAL_UART_Transmit_printf(&huart2, "DOWN ");
          HAL_NVIC_DisableIRQ(EXTI9_5_IRQn);
          // SW "DOWN"
          if( setting == 0 ){
            if( mode == 0 ){
              mode = N_mode-1;
            }else{
              mode--;
            }
          }
          break;
        case 3:
          HAL_UART_Transmit_printf(&huart2, "ENTER ");
          HAL_NVIC_DisableIRQ (EXTI1_IRQn);
          // SW "ENTER"

          // if( setting == 0 ){
          //   mode = cursor;
          //   u8g2_ClearBuffer(&u8g2);
          // }else{
          //   mode = 10;
          // }
          // break;

        default:
          break;
      }
      u8g2_ClearBuffer(&u8g2);
      if( mode == 0 ){
        draw_MeasLabels();
        draw_indicators();

      }else if( mode == 1 ){
        for( n=0; n<N_meas_C; n++ ){
          x = meas_C_x;
          y = n * meas_C_height	+ meas_C_y;
          draw_MeasLabelUnit(&u8g2, x, y, meas_C_width, meas_C_height, meas_name[n], meas_unit[n]);
        }
        // draw indicators
        for( n=0; n<4; n++ ){
          draw_IndicatorBox(&u8g2, idct_x+(idct_width+2)*n, idct_y, idct_width, idct_height, idct_status[n], idct_name[n]);
        }
        draw_CircularMeter_Init(32, 32, 31, 3, -60, 300, 10, 20, -1, -80, 120);
//        draw_CircularMeter_Init(26, 26, 26, 3, -60, 300, 10, 20, -1, -80, 120);
        draw_CircularMeter(&u8g2, 0);

      }else if( mode == 2 ){
        draw_Wave_axis(&u8g2, wave_x, wave_y, wave_width, wave_height, wave_value_min, wave_value_max);
        draw_MeasLabelUnit(&u8g2, 0, 0, 64, 13, "MAP", "kPa");

