imashio/STM32F303_MFM/Src/main.c
      }
      u8g2_SendBuffer(&u8g2);
      TIM6->CNT = 0;
      flag_sw = 0;
    }

    ///// Display sequence ----------------------------------------------------------------
    if( flag_disp == 1 ){
      ///// multi meter /////
      if( mode == 0 ){
        // update Fuel Pump Voltage
        draw_Value(&u8g2, FP_x, FP_y, FP_duty_width, FP_height, FP_duty, 3, 0, 0, "%  ");

        // draw bar graph
        draw_BarGraph(&u8g2, rpmbar_x, rpmbar_y, rpmbar_width, rpmbar_height, rpm, rpm_min, rpm_max);

        // draw measurement data
        for( n=0; n<3; n++ ){
          x = meas_x;
          y = (n % 3) * meas_height	+ meas_y;
          draw_Value(&u8g2, x, y, meas_width1, meas_height, meas_value[n], meas_digit[n], meas_frac[n], meas_sign[n], meas_unit[n]);
        }
        for( n=3; n<N_meas; n++ ){
          x = meas_width1 + meas_x + meas_x_offset;
          y = (n % 3) * meas_height	+ meas_y;
          draw_Value(&u8g2, x, y, meas_width2, meas_height, meas_value[n], meas_digit[n], meas_frac[n], meas_sign[n], meas_unit[n]);
        }
        
      ///// Circular Meter /////
      }else if( mode == 1 ){

        draw_CircularMeter(&u8g2, meas_value[0]);
        
        draw_Value(&u8g2, 36, 33, 30, 16, meas_value[0], 3, 2, 1, "");
        draw_MeasUnit(&u8g2, 38, 40, 28, 16, "kPa");
/*        
        draw_Value(&u8g2, 34, 28, 30, 16, meas_value[0], 3, 2, 1, "");
        draw_MeasUnit(&u8g2, 36, 36, 28, 16, "kPa");
*/

        // draw measurement data
        for( n=0; n<N_meas_C; n++ ){
          x = meas_C_x;
          y = n * meas_C_height	+ meas_C_y;
          draw_Value(&u8g2, x, y, meas_C_width, meas_C_height, meas_value[n], meas_digit[n], meas_frac[n], meas_sign[n], meas_unit[n]);
        }

      ///// Scope /////
      }else if( mode == 2 ){

        if( circular_buffer_index > 0 ){
          circular_buffer_index--;
        }else{
          circular_buffer_index = 128;
        }
        circular_buffer[circular_buffer_index] = meas_value[0];

        // draw wave
        draw_Wave(&u8g2, wave_x, wave_y, wave_width, wave_height, wave_value_min, wave_value_max, circular_buffer, circular_buffer_index);
        draw_Value(&u8g2, 0, 0, 64, 13, circular_buffer[circular_buffer_index], 3, 2, 1, "kPa");

      // mode setting
      }else if( setting == 1 ){
        u8g2_ClearBuffer(&u8g2);
        u8g2_SetFont(&u8g2, u8g2_font_7x14B_tf);
        u8g2_DrawStr(&u8g2, 2, 15, "Mode Setting" );
        if( cursor == 0 ){
          u8g2_DrawStr(&u8g2, 2, 30, ">" );
        }else{
          u8g2_DrawStr(&u8g2, 2, 30, " " );
        }
        u8g2_DrawStr(&u8g2,10, 30, "Multi-Meter" );
        if( cursor == 1 ){
          u8g2_DrawStr(&u8g2, 2, 45, ">" );
        }else{
          u8g2_DrawStr(&u8g2, 2, 45, " " );
        }
        u8g2_DrawStr(&u8g2,10, 45, "Scope" );
        u8g2_SendBuffer(&u8g2);
      }
      // send buffer
      u8g2_SendBuffer(&u8g2);

      flag_disp = 0; // enable again by TIM2 interrupt
    }

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_BYPASS;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1|RCC_PERIPHCLK_I2C1
                              |RCC_PERIPHCLK_TIM1;
  PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK1;
  PeriphClkInit.I2c1ClockSelection = RCC_I2C1CLKSOURCE_HSI;
  PeriphClkInit.Tim1ClockSelection = RCC_TIM1CLK_HCLK;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d¥r¥n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
